/******************************************************************************
Зад1
Дадена е редицата от числа 5, 14, 13, 6, 8 и редицата от символи d,
k, x, T, 9, j. Да се напише програма, която извежда на екрана
стойностите на двете редици.

*******************************************************************************/
#include <iostream>

using namespace std;

int main(){
    char lettersArray[6] = {'d', 'k', 'x', 'T', '9', 'j'}; 
    int numsArray[5] = { 5 , 14, 13, 6, 8}; 
    
    for(int x = 0; x<6; x++){
        cout << " Char[" << x << "]:" << lettersArray[x];
    } 
    
    cout << '\n'; 
    for(int y = 0; y<5; y++){
        cout << " Num[" << y << "]:" << numsArray[y];
    }
    
    return 0;
}