/******************************************************************************
Зад.6
Дадена е редицата от символи s0, s1, s2 ... sn-1, където (n>1). Да се
изведат само символите на цифри от редицата.

*******************************************************************************/
#include <iostream>
using namespace std;

int main(){
    char lettersArray[6] = {'d', 'k', '5', 'T', '9', 'j'}; 
    
    for(int y = 0; y < 6; y++){
         
        if((int)lettersArray[y] > 47 && (int)lettersArray[y] < 58){
            cout << lettersArray[y] << endl;
        } 
    } 
    
    return 0;
}