/******************************************************************************
Нечетни
Зад.2:
Да се напише програма, чрез която се въвеждат от клавиатурата цяло число. 
Да се намери факториел на въведеното число.
*******************************************************************************/
#include <iostream>
using namespace std;

int main(){
    int sum = 1;
    int n; 
    
    cout << "Въведете цяло число n" << endl;  
    cin >> n; 
    
    for(int x = n; x > 0; x--){
        sum *= x;
    }
    
    cout << n << "!" << " = " << sum; 

    return 0;
}