/******************************************************************************
Нечетни
Зад.3:
Да се напише програма, чрез която се въвежда редицата от числа а0, а1, а2 ... аn-1, където (n>1). 
Да се намери:
- сумата на всички числа;
- средната стойност;
- най-малкото число.
*******************************************************************************/
#include <iostream>
using namespace std;

int main(){
    double sum = 0.00; 
    double average; 
    double min;
    int n;  
    
    do{
    cout << "Въведете брой елементи n на редицата, където (n > 1)" << endl;  
    cin >> n;
    } while ( n <= 1);
    
    double arr[n]; 
    
    for(int x = 0; x < n; x++){
        double num;
        cout << "Въведете елемент [" << x << "] oт редицата" << endl;
        cin >> num;
        arr[x] = num;
    } 
    
    min = arr[0];
    for(int y = 0; y < n; y++ ){
        sum += arr[y]; 
        if(min > arr[y]){
            min = arr[y];
        }
    } 
    
    average = sum / n; 
    
    cout << "Обща сума: " << sum << endl; 
    cout << "Най-малка стойност: " << min << endl;
    cout << "Средна стойност: " << average;
    
    return 0;
}