/******************************************************************************
Нечетни
Зад.4:
Да се напише програма, с която се въвеждат стойностите на квадратна матрица A[n][n]. 
Да се намери сумата на числата от главния диагонал и втория диагонал на матрицата.
*******************************************************************************/
#include <iostream>
using namespace std;

int main(){
    int n; 
    cout << "Въведете големина на квадратна матрица: " << endl; 
    cin >> n; 
    double diag1 = 0.00, diag2 = 0.00;
    
    double arr[n][n]; 
    
    for(int x = 0; x < n; x++){
        for(int y = 0; y < n; y++){
            double num;
            cout << "Въведете елемент [" << x << "][" << y << "] от матрицата: " << endl; 
            cin >> num;
            arr[x][y] = num;
        }
    } 
    
    for(int x = 0; x < n; x++){
        for(int y = 0; y < n; y++ ){
            if(x == y){
                diag1 += arr[x][y];
            } 
            if( y == (n - x - 1)){
                diag2 += arr[x][y];
            }
        }
    } 
    
    double sum = diag1 + diag2;
    cout << "Сума от диагоналитe на матрицата: " << sum;
    
    return 0;
}