/******************************************************************************
Четни
Зад.2:
Да се напише програма, чрез която се въвеждат от клавиатурата редица от числа, 
като редицата се прекъсва със задаване на числото 0. 
Да се изведе на екрана средноаритметичната им стойност.:
*******************************************************************************/
#include <iostream> 
using namespace std;

int main(){ 
    double sum = 0.00;
    int couter = 0; 
    double x;
    
    do{
        double n;
        cout << "Въведете число n" << endl;
        cin >> n;
        x = n; 
        couter++; 
        sum+= x;
    } while (x != 0);
    
    couter--;
    double averagre = sum / couter; 
    cout << "Средно стойност: " << averagre;
    return 0;
}