/******************************************************************************
Четни
Зад.3:
Да се напише програма, която при въведена малка латинска буква извежда главната такава.
*******************************************************************************/
#include <iostream> 
using namespace std;

int main(){ 
    char a; 
    cout << "Въведете малка латинска буква: " << endl; 
    cin >> a; 
    
    char b = (int)a - 32; 
    cout << "Главна латинска буква: " << b;
    return 0;
}